#Напишите программу, которая будет преобразовывать десятичное число в двоичное.upgrade

s=int(input())
print(bin(s))