# This is a sample Python script.
#Создать телефонный справочник с возможностью импорта и экспорта
#данных в нескольких форматах.
#- * под форматами понимаем структуру файлов, например: в файле на одной строке
# хранится одна часть записи, пустая строка - разделитель *
# *Фамилия_1 * *Имя_1 * *Телефон_1 * *Описание_1 *
# *Фамилия_2 * *Имя_2 * *Телефон_2 * *Описание_2 * *и т.д.в файле на одной строке хранится все
# записи, символ разделитель - **; ** * *Фамилия_1, Имя_1, Телефон_1, Описание_1 * *Фамилия_2, Имя_2, Телефон_2, Описание_2 *

# Press Shift+F10 to execute it or replace it with your code.
# Press Double Shift to search everywhere for classes, files, tool windows, actions, and settings.


def print_hi(name):
    # Use a breakpoint in the code line below to debug your script.
    print(f'Hi, {name}')  # Press Ctrl+F8 to toggle the breakpoint.


# Press the green button in the gutter to run the script.
if __name__ == '__main__':
    print_hi('PyCharm')

# See PyCharm help at https://www.jetbrains.com/help/pycharm/
