# 1. Напишите программу вычисления арифметического выражения заданного строкой.
# Используйте операции +,-,/,*. приоритет операций стандартный.
#     *Пример:*
#     2+2 => 4;
#     1+2*3 => 7;
#     1-2*3 => -5;
#     - Добавьте возможность использования скобок, меняющих приоритет операций.
#         *Пример:*
#         1+2*3 => 7;
#         (1+2)*3 => 9;

n = input()
l = n.split()
# opList = []
# numbers = []
# for i in range(len(l)):
#     if i % 2 != 0:
#         opList.append(l[i])
#     else:
#         numbers.append(l[i])

# first = 0
# second = 0
# if first == '/' and second == '*':
#     first,second =

# 43. Дана последовательность чисел.
# Получить список уникальных элементов заданной последовательности.
# *Пример:*
# [1, 2, 3, 5, 1, 5, 3, 10] => [2, 10]


print(eval(input()))
