# # Напишите программу, которая принимает на вход вещественное число и показывает сумму его цифр.//
# # Пример:
# # 6782 -> 23
# # 0,56 -> 11

# n = input()


# def sum(_n):
#     sum = 0
#     _n = _n.replace('.', '')
#     for i in range(len(_n)):
#         sum += int(_n[i])
#     return sum


# s = sum(n)
# print(int(s))

from datetime import datetime
a = int(str(input()).replace('.', ''))  # заменит сразу 4 строчки кода


def
